In [1]:
import pandas as pd
import numpy as np
import scipy.stats as ss
import matplotlib.pyplot as plt

In [2]:
csv_in = '../ai-03/running.csv'

In [19]:
df = pd.read_csv(csv_in,delimiter=',',skiprows=0,header=0)
print(df.shape)
print(df.info())
display(df.head())

(50, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
ID       50 non-null int64
Univ     48 non-null object
Grade    50 non-null int64
Time     49 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1002  NaN      2  1937.0
2  1003  NaN      1  2036.0
3  1004    C      1  1957.0
4  1005    D      1     NaN

In [21]:
df2 = df.dropna(axis=0).reset_index(drop=True)
display(df2.head())

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1004    C      1  1957.0
2  1006    D      2  2063.0
3  1007    D      3  1839.0
4  1008    C      2  1740.0

In [23]:
ct = pd.crosstab(index=df2['Univ'],columns=df2['Grade'], margins=True)
display(ct.head())

Grade   1   2   3   4  All
Univ
A       3   4   5   4   16
B       2   1   2   3    8
C       1   3   1   3    8
D       5   3   6   1   15
All    11  11  14  11   47

In [25]:
df_univ = df2.groupby('Univ').mean()
display(df_univ['Time'])

Univ
A    1918.375000
B    1936.375000
C    1930.250000
D    1886.466667
Name: Time, dtype: float64

In [27]:
pv = pd.pivot_table(df2, index='Univ', columns='Grade', values='Time', aggfunc=np.mean)
display(pv)

Grade            1            2            3            4
Univ
A      1980.666667  1970.750000  1835.200000  1923.250000
B      1860.500000  1974.000000  2067.000000  1887.333333
C      1957.000000  1881.666667  1937.000000  1967.666667
D      1874.600000  1957.000000  1854.833333  1924.000000